ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_ertc.h
/*********************************************************************************************************//**
 * @file    ht32l5xxxx_ertc.h
 * @version $Rev:: 1172         $
 * @date    $Date:: 2026-02-09 #$
 * @brief   The header file of the ERTC library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __ht32l5XXXX_ERTC_H
#define __ht32l5XXXX_ERTC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32L5xxxx_Peripheral_Driver HT32L5xxxx Peripheral Driver
  * @{
  */

/** @addtogroup ERTC
  * @{
  */

/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup ERTC_Exported_Types ERTC exported types
  * @{
  */
/**
  * @brief  ERTC Time structure definition
  */
typedef struct
{
  u8 Hours;    /*!< Specifies the ERTC Time Hour.                                                           */
  u8 Minutes;  /*!< Specifies the ERTC Time Minutes.                                                        */
  u8 Seconds;  /*!< Specifies the ERTC Time Seconds.                                                        */
  u8 AMPM;     /*!< Specifies the ERTC AM/PM Time.                                                          */
  u8 FMT;      /*!< Specifies the ERTC 12-hour or 24-hour Format.                                           */
}ERTC_TimeTypeDef;

/**
  * @brief  ERTC Date structure definition
  */
typedef struct
{
  u8 WeekDay; /*!< Specifies the ERTC Date WeekDay.                                                         */
  u8 Month;   /*!< Specifies the ERTC Date Month.                                                           */
  u8 Day;     /*!< Specifies the ERTC Date Day.                                                             */
  u8 Year;    /*!< Specifies the ERTC Date Year.                                                            */
}ERTC_DateTypeDef;

/**
  * @brief  ERTC Init structures definition
  */
typedef struct
{
  u8  AsynchPrediv;      /*!< Specifies the ERTC Asynchronous Predivider value.                             */
  u16 SynchPrediv;       /*!< Specifies the ERTC Synchronous Predivider value.                              */
  ERTC_DateTypeDef Date;
  ERTC_TimeTypeDef Time;
}ERTC_InitTypeDef;

/**
  * @brief  ERTC Alarm Mask structure definition
  */
typedef struct
{
  u8 AlarmMask_Minute;
  u8 AlarmMask_Second;
  u8 AlarmMask_Day;
  u8 AlarmMask_Hour;
}ERTC_AlarmMaskTypeDef;

/**
  * @brief  ERTC Alarm structure definition
  */
typedef struct
{
  ERTC_TimeTypeDef AlarmTime;      /*!< Specifies the ERTC Alarm Time members.                              */
  ERTC_AlarmMaskTypeDef AlarmMask; /*!< Specifies the ERTC Alarm Masks.                                     */
  u16 AlarmDateWeekDaySel;         /*!< Specifies the ERTC Alarm is on Date or WeekDay.                     */
  u8  AlarmDateWeekDay;            /*!< Specifies the ERTC Alarm Date/WeekDay.                              */
}ERTC_AlarmTypeDef;

/**
 * @brief Selection of ERTC LSE startup mode
 */
typedef enum
{
  ERTC_LSESM_SLOW    = 0,
  ERTC_LSESM_MEDIUM_SLOW,
  ERTC_LSESM_MEDIUM_FAST,
  ERTC_LSESM_SUPPER_FAST
} ERTC_LSESM_Enum;

/**
 * @brief Enumeration of ERTC HSE Prescaler Selection.
 */
typedef enum
{
  ERTC_HSEPRE_DIV32 = 0x0,
  ERTC_HSEPRE_DIV16 = 0x4,
  ERTC_HSEPRE_DIV8  = 0x8,
  ERTC_HSEPRE_DIV4  = 0xC,
} ERTC_HSEDIV_Enum;

/**
 * @brief Event selection of RTC output
 */
typedef enum
{
  ERTC_ROES_ALARM  = 0x0000,
  ERTC_ROES_WAKEUP = 0x1000,
  ERTC_ROES_SPRE   = 0x2000,
  ERTC_ROES_APRE   = 0x3000,
} ERTC_ROES_Enum;

/**
 * @brief Waveform mode of RTC output
 */
typedef enum
{
  ERTC_ROWM_TOGGLE = 0x0000,
  ERTC_ROWM_PULSE  = 0x0400,
  ERTC_ROWM_LEVEL  = 0x0800
} ERTC_ROWM_Enum;

/**
 * @brief Active polarity of RTC output
 */
typedef enum
{
  ERTC_ROAP_HIGH = 0x0000,
  ERTC_ROAP_LOW  = 0x4000
} ERTC_ROAP_Enum;

/**
 * @brief Selection of ERTC clock source
 */
typedef enum
{
  ERTC_SRC_NOCLOCK   = 0x00,
  ERTC_SRC_LSI       = 0x02,
  ERTC_SRC_LSE       = 0x04,
  ERTC_SRC_HSEPRE    = 0x06
} ERTC_SRC_Enum;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup ERTC_Exported_Constants ERTC exported constants
  * @{
  */
#define ERTC_UNPROTECT_KEY                        (0x5FA0)

/* Definitions of ERTC Hour Formats                                                                         */
#define ERTC_HOURFORMAT_MASK                      ((u8)0x40)
#define ERTC_HOURFORMAT_12                        ((u8)0x00)
#define ERTC_HOURFORMAT_24                        ((u8)0x40)

/* Definitions of ERTC AM PM                                                                                */
#define ERTC_AM                                   ((u8)0x00)
#define ERTC_PM                                   ((u8)0x40)

/* Definitions of ERTC WeekDay BCD                                                                          */
#define ERTC_WEEKDAY_MONDAY                       ((u8)0x01)
#define ERTC_WEEKDAY_TUESDAY                      ((u8)0x02)
#define ERTC_WEEKDAY_WEDNESDAY                    ((u8)0x03)
#define ERTC_WEEKDAY_THURSDAY                     ((u8)0x04)
#define ERTC_WEEKDAY_FRIDAY                       ((u8)0x05)
#define ERTC_WEEKDAY_SATURDAY                     ((u8)0x06)
#define ERTC_WEEKDAY_SUNDAY                       ((u8)0x07)

/* Definitions of ERTC AlarmDate WeekDay Selection                                                          */
#define ERTC_ALARMSEL_DATE                        ((u16)0x0000)
#define ERTC_ALARMSEL_WEEKDAY                     ((u16)0x4000)

/* Definitions of ERTC Alarm Sub Seconds Masks                                                              */
#define ERTC_ALARM_SUBSECOND_MASK_ALL             ((u8)0x00)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_1          ((u8)0x01)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_2          ((u8)0x02)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_3          ((u8)0x03)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_4          ((u8)0x04)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_5          ((u8)0x05)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_6          ((u8)0x06)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_7          ((u8)0x07)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_8          ((u8)0x08)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_9          ((u8)0x09)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_10         ((u8)0x0A)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_11         ((u8)0x0B)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_12         ((u8)0x0C)
#define ERTC_ALARM_SUBSECOND_MASK_SS14_13         ((u8)0x0D)
#define ERTC_ALARM_SUBSECOND_MASK_SS14            ((u8)0x0E)
#define ERTC_ALARM_SUBSECOND_MASK_NONE            ((u8)0x0F)

/* Definitions of Wakeup_Timer                                                                              */
#define ERTC_WUP_TM_ERTC_DIV16                    ((u8)0x00)
#define ERTC_WUP_TM_ERTC_DIV8                     ((u8)0x01)
#define ERTC_WUP_TM_ERTC_DIV4                     ((u8)0x02)
#define ERTC_WUP_TM_ERTC_DIV2                     ((u8)0x03)
#define ERTC_WUP_TM_SPRE                          ((u8)0x04)
#define ERTC_WUP_TM_SPRE_EXT                      ((u8)0x06)

