ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_ertc.h
/* Definitions of ERTC Calib Period                                                                         */
#define ERTC_CALIB_PERIOD_32                      ((u16)0x0000)
#define ERTC_CALIB_PERIOD_16                      ((u16)0x1000)
#define ERTC_CALIB_PERIOD_8                       ((u16)0x2000)

/* Definitions of ERTC Calib Plus pulses                                                                    */
#define ERTC_CALIB_ADD_PULSES                     ((u16)0x0000)
#define ERTC_CALIB_MASK_PULSES                    ((u16)0x0100)

/* Definitions of ERTC Shift Sign Parameter                                                                 */
#define ERTC_SHIFT_SIGN_ADD                       0
#define ERTC_SHIFT_SIGN_SUB                       1

/* Definitions of ERTC wakeup source Selection                                                              */
#define ERTC_WAKEUP_ALR                           0x00002000
#define ERTC_WAKEUP_WUT                           0x00004000

/* Definitions of ERTC flags                                                                                */
#define ERTC_FLAG_INITF                           0x00000001
#define ERTC_FLAG_CRSF                            0x00000002
#define ERTC_FLAG_SHPF                            0x00000008
#define ERTC_FLAG_ALRWF                           0x00000010
#define ERTC_FLAG_RTCOF                           0x00000020
#define ERTC_FLAG_ALRF                            0x00000100
#define ERTC_FLAG_TSF                             0x00000200
#define ERTC_FLAG_TSOVF                           0x00000400
#define ERTC_FLAG_WUTF                            0x00001000
#define ERTC_FLAG_WUTWF                           0x00002000

/* Definitions of ERTC Interrupts                                                                           */
#define ERTC_INT_ALR                              0x00000100
#define ERTC_INT_CRS                              0x00000400
#define ERTC_INT_WUT                              0x00001000

/* Definitions of Timestamp Event Source                                                                    */
#define ERTC_TS_WAKEUP0_EVT                       0x00000000
#define ERTC_TS_WAKEUP1_EVT                       0x00004000

/**
 * @brief Used to check parameter of the ERTC.
 */
#define IS_ERTC_HOUR_FORMAT(FORMAT)   (((FORMAT) == ERTC_HOURFORMAT_12) || ((FORMAT) == ERTC_HOURFORMAT_24))

#define IS_ERTC_ASYNCH_PREDIV(PREDIV) ((PREDIV) <= 0x7F)

#define IS_ERTC_SYNCH_PREDIV(PREDIV)  ((PREDIV) <= 0x7FFF)

#define IS_ERTC_HOUR12(HOUR)          (((HOUR) > 0) && ((HOUR) <= 12))
#define IS_ERTC_HOUR24(HOUR)          ((HOUR) <= 23)
#define IS_ERTC_MINUTES(MINUTES)      ((MINUTES) <= 59)
#define IS_ERTC_SECONDS(SECONDS)      ((SECONDS) <= 59)

#define IS_ERTC_AMPM(PM)              (((PM) == ERTC_AM) || ((PM) == ERTC_PM))

#define IS_ERTC_YEAR(YEAR)            ((YEAR)  <= 99)

#define IS_ERTC_MONTH(MONTH)          (((MONTH) >= 1) && ((MONTH) <= 12))
#define IS_ERTC_DATE(DATE)            (((DATE) >= 1) && ((DATE) <= 31))

#define IS_ERTC_WEEKDAY(WEEKDAY) (((WEEKDAY) == ERTC_WEEKDAY_MONDAY)    || \
                                  ((WEEKDAY) == ERTC_WEEKDAY_TUESDAY)   || \
                                  ((WEEKDAY) == ERTC_WEEKDAY_WEDNESDAY) || \
                                  ((WEEKDAY) == ERTC_WEEKDAY_THURSDAY)  || \
                                  ((WEEKDAY) == ERTC_WEEKDAY_FRIDAY)    || \
                                  ((WEEKDAY) == ERTC_WEEKDAY_SATURDAY)  || \
                                  ((WEEKDAY) == ERTC_WEEKDAY_SUNDAY))

#define IS_ERTC_ALARM_DATE_WEEKDAY_DATE(DATE) (((DATE) > 0) && ((DATE) <= 31))
#define IS_ERTC_ALARM_DATE_WEEKDAY_WEEKDAY(WEEKDAY) (((WEEKDAY) == ERTC_WEEKDAY_MONDAY)    || \
                                                     ((WEEKDAY) == ERTC_WEEKDAY_TUESDAY)   || \
                                                     ((WEEKDAY) == ERTC_WEEKDAY_WEDNESDAY) || \
                                                     ((WEEKDAY) == ERTC_WEEKDAY_THURSDAY)  || \
                                                     ((WEEKDAY) == ERTC_WEEKDAY_FRIDAY)    || \
                                                     ((WEEKDAY) == ERTC_WEEKDAY_SATURDAY)  || \
                                                     ((WEEKDAY) == ERTC_WEEKDAY_SUNDAY))

#define IS_ERTC_ALARM_DATE_WEEKDAY_SEL(SEL) (((SEL) == ERTC_ALARMSEL_DATE) || \
                                             ((SEL) == ERTC_ALARMSEL_WEEKDAY))

#define IS_ERTC_ALARM_SUB_SECOND_MASK(MASK) (((MASK) == ERTC_ALARM_SUBSECOND_MASK_ALL)     || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_1)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_2)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_3)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_4)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_5)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_6)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_7)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_8)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_9)  || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_10) || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_11) || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_12) || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14_13) || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_SS14)    || \
                                             ((MASK) == ERTC_ALARM_SUBSECOND_MASK_NONE))

