ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_ertc.h
#define IS_ERTC_LSESM(x) ((x == ERTC_LSESM_SLOW) || (x == ERTC_LSESM_MEDIUM_SLOW) || (x == ERTC_LSESM_MEDIUM_FAST) ||(x == ERTC_LSESM_SUPPER_FAST))

#define IS_ERTC_HSE_DIV(DIV) (((DIV) == ERTC_HSEPRE_DIV32) || \
                              ((DIV) == ERTC_HSEPRE_DIV16) || \
                              ((DIV) == ERTC_HSEPRE_DIV8 ) || \
                              ((DIV) == ERTC_HSEPRE_DIV4 ))

#define IS_ERTC_CLOCK_SRC(SOURCE) (((SOURCE) == ERTC_SRC_NOCLOCK) || \
                                   ((SOURCE) == ERTC_SRC_LSI)     || \
                                   ((SOURCE) == ERTC_SRC_LSE)     || \
                                   ((SOURCE) == ERTC_SRC_HSEPRE))

#define IS_ERTC_WAKEUP_CLOCK(CLOCK) (((CLOCK) == ERTC_WUP_TM_ERTC_DIV16) || \
                                     ((CLOCK) == ERTC_WUP_TM_ERTC_DIV8)  || \
                                     ((CLOCK) == ERTC_WUP_TM_ERTC_DIV4)  || \
                                     ((CLOCK) == ERTC_WUP_TM_ERTC_DIV2)  || \
                                     ((CLOCK) == ERTC_WUP_TM_SPRE)       || \
                                     ((CLOCK) == ERTC_WUP_TM_SPRE_EXT))

#define IS_ERTC_WAKEUP_COUNTER(COUNTER) ((COUNTER) <= 0xFFFF)

#define IS_ERTC_OUTPUT(OUTPUT) (((OUTPUT) == ERTC_ROES_ALARM)  || \
                                ((OUTPUT) == ERTC_ROES_WAKEUP) || \
                                ((OUTPUT) == ERTC_ROES_SPRE)   || \
                                ((OUTPUT) == ERTC_ROES_APRE))

#define IS_ERTC_OUTPUT_MODE(MODE) (((MODE) == ERTC_ROWM_TOGGLE) || \
                                   ((MODE) == ERTC_ROWM_PULSE)  || \
                                   ((MODE) == ERTC_ROWM_LEVEL))

#define IS_ERTC_OUTPUT_POL(POL)  (((POL) == ERTC_ROAP_HIGH) ||  \
                                  ((POL) == ERTC_ROAP_LOW))

#define IS_ERTC_ALARM_SUB_SECOND_VALUE(VALUE) ((VALUE) <= 0x00007FFF)

#define IS_ERTC_CALIB_PERIOD(PERIOD) (((PERIOD) == ERTC_CALIB_PERIOD_32) || \
                                      ((PERIOD) == ERTC_CALIB_PERIOD_16) || \
                                      ((PERIOD) == ERTC_CALIB_PERIOD_8))

#define IS_ERTC_CALIB_PLUS(PLUS) (((PLUS) == ERTC_CALIB_ADD_PULSES) || \
                                  ((PLUS) == ERTC_CALIB_MASK_PULSES))

#define IS_ERTC_CALIB_VALUE(VALUE) ((VALUE) <= 0x000000FF)

#define IS_ERTC_SHIFT_SIGN(SEL) (((SEL) == ERTC_SHIFT_SIGN_ADD) || \
                                 ((SEL) == ERTC_SHIFT_SIGN_SUB))

#define IS_ERTC_SHIFT_VALUE(FS) ((FS) <= 0x00007FFF)

#define IS_ERTC_WAKEUP(SOURCE) (((SOURCE) == ERTC_WAKEUP_ALR) || \
                                ((SOURCE) == ERTC_WAKEUP_WUT))

#define IS_ERTC_GET_FLAG(FLAG) (((FLAG) == ERTC_FLAG_INITF) || ((FLAG) == ERTC_FLAG_CRSF)   || \
                                ((FLAG) == ERTC_FLAG_SHPF)  || ((FLAG) == ERTC_FLAG_ALRWF)  || \
                                ((FLAG) == ERTC_FLAG_RTCOF) || ((FLAG) == ERTC_FLAG_ALRF)   || \
                                ((FLAG) == ERTC_FLAG_TSF)   || ((FLAG) == ERTC_FLAG_TSOVF)  || \
                                ((FLAG) == ERTC_FLAG_WUTF)  || ((FLAG) == ERTC_FLAG_WUTWF))

#define IS_ERTC_CLEAR_FLAG(FLAG) ((FLAG) != RESET)

#define IS_ERTC_CONFIG_INT(INT) ((INT == ERTC_INT_ALR) || (INT == ERTC_INT_CRS) || (INT == ERTC_INT_WUT))

#define IS_ERTC_TS_EVT(FLAG) (((FLAG) == ERTC_TS_WAKEUP0_EVT) || ((FLAG) == ERTC_TS_WAKEUP1_EVT))

/**
  * @}
  */

/** @defgroup RTC_Compatibility_Define RTC compatibility definitions
  * @{
  */
#define RTC_SRC_LSI                               ERTC_SRC_LSI
#define RTC_SRC_LSE                               ERTC_SRC_LSE

#define RTC_LSESM_NORMAL                          ERTC_LSESM_SLOW
#define RTC_LSESM_FAST                            ERTC_LSESM_MEDIUM_FAST
#define RTC_LSESM_SLOW                            ERTC_LSESM_SLOW
#define RTC_LSESM_MEDIUM_SLOW                     ERTC_LSESM_MEDIUM_SLOW
#define RTC_LSESM_MEDIUM_FAST                     ERTC_LSESM_MEDIUM_FAST
#define RTC_LSESM_SUPPER_FAST                     ERTC_LSESM_SUPPER_FAST

#define RTC_RPRE_1                                0x00, 0x00
#define RTC_RPRE_2                                0x01, 0x00
#define RTC_RPRE_4                                0x03, 0x00
#define RTC_RPRE_8                                0x07, 0x00
#define RTC_RPRE_16                               0x0F, 0x00
#define RTC_RPRE_32                               0x1F, 0x00
#define RTC_RPRE_64                               0x3F, 0x00
#define RTC_RPRE_128                              0x7F, 0x00
#define RTC_RPRE_256                              0x7F, 0x01
#define RTC_RPRE_512                              0x7F, 0x03
#define RTC_RPRE_1024                             0x7F, 0x07
#define RTC_RPRE_2048                             0x7F, 0x0F
#define RTC_RPRE_4096                             0x7F, 0x1F
#define RTC_RPRE_8192                             0x7F, 0x3F
#define RTC_RPRE_16384                            0x7F, 0x7F
#define RTC_RPRE_32768                            0x7F, 0xFF

#define RTC_WAKEUP_CM                             1
#define RTC_WAKEUP_CSEC                           2

#define RTC_INT_CM                                1
#define RTC_INT_CSEC                              2

#define RTC_FLAG_CM                               ERTC_FLAG_WUTF
#define RTC_FLAG_CSEC                             ERTC_FLAG_WUTF

#define RTC_ROAP_HIGH                             ERTC_ROAP_HIGH
#define RTC_ROAP_LOW                              ERTC_ROAP_LOW

#define RTC_ROWM_PULSE                            ERTC_ROWM_PULSE
#define RTC_ROWM_LEVEL                            ERTC_ROWM_LEVEL

#define RTC_ROES_MATCH                            1
#define RTC_ROES_SECOND                           2

#define RTC_FLAG_MASK                             0x1000

#define GET_COMPARE                               0
#define GET_COUNTER                               1

#define UNPROTECT(FUN)                            ERTC_SetUnProtectKey(ERTC_UNPROTECT_KEY); \
                                                  FUN; \
                                                  ERTC_SetUnProtectKey(0); \

