ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_ertc.h
#define RTC_IRQn                                  ERTC_IRQn
#define RTC_IRQHandler                            ERTC_IRQHandler

#define RTC_DeInit()                              UNPROTECT(ERTC_DeInit())
#define RTC_ClockSourceConfig(Source)             UNPROTECT(ERTC_ClockSourceConfig(Source))
#define RTC_LSESMConfig(Mode)                     UNPROTECT(ERTC_LSESMConfig(Mode))
#define RTC_LSECmd(NewState)                      UNPROTECT(ERTC_LSECmd(NewState))
#define RTC_SetPrescaler(Psc)                     UNPROTECT(ERTC_SetPrescaler(Psc))
#define RTC_GetPrescaler()                        (ERTC_GetSynchronousPrescaler() + 1) * (ERTC_GetAsynchronousPrescaler() + 1)
#define RTC_Cmd(NewState)                         ERTC_SetUnProtectKey(ERTC_UNPROTECT_KEY); \
                                                  ERTC_WakeupTimerClockConfig(ERTC_WUP_TM_SPRE); \
                                                  ERTC_WakeupTimerCmd(NewState); \
                                                  ERTC_Cmd(NewState); \
                                                  ERTC_SetUnProtectKey(0)
#define RTC_SetCompare(Compare)                   UNPROTECT(ERTC_SetWakeupTimerCompare(Compare);)
#define RTC_WakeupConfig(RTC_WAKEUP, NewState)    UNPROTECT(\
                                                  RTC_CheckWakeupTimerSetting(RTC_WAKEUP); \
                                                  if ((RTC_WAKEUP) == 2 && RTC_GetCompare() != 1) \
                                                    ERTC_SetWakeupTimerCompare(1); \
                                                  ERTC_WakeupConfig(ERTC_WAKEUP_WUT, NewState))
#define RTC_IntConfig(RTC_INT, NewState)          UNPROTECT(\
                                                  RTC_CheckWakeupTimerSetting(RTC_INT); \
                                                  if ((RTC_INT) == 2 && RTC_GetCompare() != 1) \
                                                    ERTC_SetWakeupTimerCompare(1); \
                                                  ERTC_IntConfig(ERTC_INT_WUT, NewState))
#define RTC_OutConfig(WMode, EventSel, Pol)       UNPROTECT(\
                                                  ERTC_CheckWakeupTimerSetting(EventSel); \
                                                  gWakeupTimerLastSetting = EventSel; \
                                                  if ((EventSel) == 2 && RTC_GetCompare() != 1) \
                                                    ERTC_SetWakeupTimerCompare(1); \
                                                  ERTC_OutConfig(WMode, ERTC_ROES_WAKEUP, Pol))
#define RTC_OutCmd(NewState)                      UNPROTECT(ERTC_OutCmd(NewState))

/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup ERTC_Exported_Functions ERTC exported functions
  * @{
  */
void ERTC_DeInit(void);
void ERTC_InitBCD(ERTC_InitTypeDef* ERTC_InitStruct);
void ERTC_Init(ERTC_InitTypeDef* ERTC_InitStruct);
void ERTC_StructInit(ERTC_InitTypeDef* ERTC_InitStruct);
void ERTC_Cmd(ControlStatus NewState);
void ERTC_SetUnProtectKey(u16 uUnProtectKey);
void ERTC_WriteProtectionCmd(ControlStatus NewState);
void ERTC_SetPrescaler(u8 AsynchPrediv, u16 SynchPrediv);
u8 ERTC_GetAsynchronousPrescaler(void);
u16 ERTC_GetSynchronousPrescaler(void);

void ERTC_ClockSourceConfig(ERTC_SRC_Enum Source);
void ERTC_LSESMConfig(ERTC_LSESM_Enum Mode);
void ERTC_LSECmd(ControlStatus NewState);
void ERTC_SetHSEPrescaler(ERTC_HSEDIV_Enum Div);

void ERTC_IntConfig(u32 ERTC_INT_x, ControlStatus NewState);
FlagStatus ERTC_GetFlagStatus(u32 ERTC_FLAG_x);
void ERTC_ClearFlag(u32 ERTC_FLAG_x);

void ERTC_SetTimeBCD(ERTC_TimeTypeDef* ERTC_TimeStruct);
void ERTC_SetDateBCD(ERTC_DateTypeDef* ERTC_DateStruct);
void ERTC_SetTime(ERTC_TimeTypeDef* ERTC_TimeStruct);
void ERTC_SetDate(ERTC_DateTypeDef* ERTC_DateStruct);
void ERTC_GetDateBCD(ERTC_DateTypeDef* ERTC_DateStruct);
void ERTC_GetTimeBCD(ERTC_TimeTypeDef* ERTC_TimeStruct);
void ERTC_GetDateTimeBCD(ERTC_DateTypeDef* ERTC_DateStruct, ERTC_TimeTypeDef* ERTC_TimeStruct);
void ERTC_GetDate(ERTC_DateTypeDef* ERTC_DateStruct);
void ERTC_GetTime(ERTC_TimeTypeDef* ERTC_TimeStruct);
void ERTC_GetDateTime(ERTC_DateTypeDef* ERTC_DateStruct, ERTC_TimeTypeDef* ERTC_TimeStruct);
u32 ERTC_GetSubSecond(void);
u32 ERTC_GetSubSecondms(void);
u32 ERTC_GetSubSecondus(void);
u32 ERTC_EpochTime(void);

void ERTC_WakeupTimerClockConfig(u8 ERTC_WakeupClock);
void ERTC_SetWakeupTimerCompare(u32 Compare);
u32 ERTC_GetWakeupTimerCompare(void);
void ERTC_WakeupTimerCmd(ControlStatus NewState);
void ERTC_WakeupConfig(u32 ERTC_WAKEUP, ControlStatus NewState);

void ERTC_SetAlarmBCD(ERTC_AlarmTypeDef* ERTC_AlarmStruct);
void ERTC_SetAlarm(ERTC_AlarmTypeDef* ERTC_AlarmStruct);
void ERTC_AlarmSubSecondConfig(u16 ERTC_AlarmSubSecondValue, u8 ERTC_AlarmSubSecondMask);
void ERTC_AlarmCmd(ControlStatus NewState);

void ERTC_OutConfig(ERTC_ROWM_Enum WMode, ERTC_ROES_Enum EventSel, ERTC_ROAP_Enum Pol);
void ERTC_OutCmd(ControlStatus NewState);

void ERTC_CalibConfig(u16 ERTC_CalibPeriod, u16 ERTC_CalibPlusMask, u8 ERTC_CalibValue);
void ERTC_CalibCmd(ControlStatus NewState);

void ERTC_TimeStampCmd(ControlStatus NewState);
void ERTC_GetTimeStampBCD(ERTC_DateTypeDef* ERTC_StampDateStruct, ERTC_TimeTypeDef* ERTC_StampTimeStruct);
void ERTC_GetTimeStamp(ERTC_DateTypeDef* ERTC_StampDateStruct, ERTC_TimeTypeDef* ERTC_StampTimeStruct);
u32 ERTC_GetTimeStampSubSecond(void);
u32 ERTC_GetTimeStampSubSecondms(void);
u32 ERTC_GetTimeStampSubSecondus(void);
FlagStatus ERTC_GetTimestampEventSourceStatus(u32 ERTC_TS_EVT);

void ERTC_SynchroShiftConfig(u8 ERTC_ShiftSign, u16 ERTC_ShiftSubFS);

void RTC_CheckWakeupTimerSetting(u8 WakeupTimerSetting);
u32 RTC_GetCompare(void);
u32 RTC_GetCounter(void);
void RTC_CMPCLRCmd(ControlStatus NewState);
u32 RTC_GetFlagStatus(void);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
